<?php
/**
 * Created by PhpStorm.
 * User: A
 * Date: 2018/11/19
 * Time: 22:56
 */

/**
 *
 Bt-Panel: http://47.99.65.128:8888/641982df
username: vtyz4pip
password: 4212c233
 *
 *
 *
 *

 *
 *
 *
 *
 *
 百度api
 *
 * 时光机1856   cc7162534

 *
 *
 * 17300668520@163.com
 * cc7162534

 *
 *
 * appid: wx5d68fecad5b54475
 *
 * AppSecret: 8457a179590528036c191b479672d23e
 *
 *
 *
 *
 *
 *
 */

//图像生成文章  https://laravel-china.org/articles/18418

//todo  头像审核   短信模板    确认信息表单字段

//todo 双方互为心动    加入心动时先检测对方是否把自己加为心动，如果加入，则自己加一条心动记录  is_hu 为1，并更新对方数据的 is_hu 为1 ，

//todo 管理员可以置顶朋友圈动态   实名用户才可以发朋友圈，非实名不可以发帖，只可以点赞，点赞，发帖的人也会收到提醒

//todo 所有通过实名认证用户都可以评论朋友圈，用户会收到提醒（动态消息[30秒轮询一次消息]），并且可以看到所有的评论。